# CentralModelException Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
CentralModelException Class
Members See Also
---
The base class for exceptions that are common to both file-based and server-based central models or specific to just file-based central models.
**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
[SerializableAttribute]
public class CentralModelException : ApplicationException
```

Visual Basic
---
```text
<SerializableAttribute> _
Public Class CentralModelException _
	Inherits ApplicationException
```

Visual C++
---
```text
[SerializableAttribute]
public ref class CentralModelException : public ApplicationException
```

# Inheritance Hierarchy
System..::..Object System..::..Exception Autodesk.Revit.Exceptions..::..ApplicationException Autodesk.Revit.Exceptions..::..CentralModelException Autodesk.Revit.Exceptions..::..CentralFileCommunicationException Autodesk.Revit.Exceptions..::..CentralModelAccessDeniedException Autodesk.Revit.Exceptions..::..CentralModelAlreadyExistsException Autodesk.Revit.Exceptions..::..CentralModelContentionException Autodesk.Revit.Exceptions..::..CentralModelVersionArchivedException Autodesk.Revit.Exceptions..::..CheckoutElementsRequestTooLargeException Autodesk.Revit.Exceptions..::..OutdatedDirectlyOpenedCentralException
# See Also
CentralModelException Members
Autodesk.Revit.Exceptions Namespace